[
    {
        "title": "What is Notebook Computer ?",
        "sub_title": "A notebook computer is a personal computer designed to be easily portable and capable of being run on batteries and electrical current, if needed.",
        "link": "https://cdn.pixabay.com/photo/2020/01/26/20/14/computer-4795762_960_720.jpg",
        "detail":"โน้ตบุ๊กคอมพิวเตอร์ (Notebook computer) เป็นเครื่องคอมพิวเตอร์ ที่ถูกออกแบบมาให้มีขนาดเล็ก สามารถขนย้ายหรือพกพาได้สะดวก โดยปกติจะมีน้ำหนักอยู่ที่ประมาณ 1-3 กก. การทำงานของแล็ปท็อปจะใช้พลังงานไฟฟ้าจากแบตเตอรี และในขณะเดียวกันก็ยังสามารถใช้พลังงานไฟฟ้าได้โดยตรงจากการเสียบปลั๊กไฟ ประสิทธิภาพของแล็ปท็อปโดยทั่วไปนั้นเทียบเท่ากับคอมพิวเตอร์ตั้งโต๊ะแบบปกติ ในขณะที่ราคาของแล็ปท็อปจะสูงกว่า โดยส่วนที่จะแตกต่างกับคอมพิวเตอร์ทั่วไปคือ จอภาพจะเป็นลักษณะจอแอลซีดี และจะมีทัชแพดที่ใช้สำหรับควบคุมการทำงานของลูกศรบริเวณหน้าจอ"
    },
    {
        "title": "What is Software ?",
        "sub_title": "Software คือ โปรแกรมที่เราไม่สามารถจับต้องได้",
        "link": "https://cdn.pixabay.com/photo/2020/10/21/18/07/laptop-5673901_960_720.jpg",
        "detail":"ซอฟต์แวร์ (อังกฤษ: software) หรือ ส่วนชุดคำสั่ง[1] คือ ส่วนหนึ่งของระบบคอมพิวเตอร์ที่ใช้ในการจัดเก็บและประมวลผลข้อมูล เป็นชุดคำสั่งที่บอกวิธีการทำงานของคอมพิวเตอร์ ซึ่งตรงกันข้ามกับฮาร์ดแวร์ที่เป็นระบบคอมพิวเตอร์ที่สามารถจับต้องได้ ในสาขาวิชาวิทยาการคอมพิวเตอร์และวิศวกรรมซอฟต์แวร์นั้น ซอฟต์แวร์คอมพิวเตอร์ คือ ข้อมูลทั้งหมดที่ได้รับการประมวลผลโดยระบบคอมพิวเตอร์ และ โปรแกรมคอมพิวเตอร์ ซอฟต์แวร์คอมพิวเตอร์นั้นประกอบด้วย โปรแกรมคอมพิวเตอร์, ไลบรารี และ ข้อมูลที่ไม่สามารถเรียกใช้งานได้ด้วยโปรแกรมคอมพิวเตอร์ อาทิ เอกสารออนไลน์หรือสื่อดิจิทัล คอมพิวเตอร์เครื่องหนึ่งจำเป็นต้องมีทั้งฮาร์ดแวร์และซอฟต์แวร์ และหากขาดอย่างใดอย่างหนึ่งไป จะไม่สามารถใช้งานระบบคอมพิวเตอร์ได้"
    },
    {
        "title": "What is Programer ?",
        "sub_title": "Programer คือ คนที่พัฒนาโปรแกรม..........",
        "link": "https://cdn.pixabay.com/photo/2016/08/29/08/55/work-1627703_960_720.jpg",
        "detail":"นักเขียนโปรแกรม หรือ โปรแกรมเมอร์ มีหน้าที่หลักคือการเขียนโปรแกรมคอมพิวเตอร์ ซึ่งนักเขียนโปรแกรมสามารถหมายถึงผู้ที่เชี่ยวชาญในการโปรแกรมเฉพาะด้าน หรือผู้ที่สามารถเขียนรหัสซอฟต์แวร์ได้หลากหลายข้อมูล เอดา ไบรอนได้ชื่อว่าเป็นนักเขียนโปรแกรมคนแรกของโลก เพราะเป็นคนแรกที่สามารถนำขั้นตอนวิธี มาเรียบเรียงเป็นชุดคำสั่ง ให้แก่เครื่องคำนวณได้ในปี พ.ศ. 2385 ในยุคที่ยังไม่มีเครื่องคอมพิวเตอร์ ส่วนนี้รอเพิ่มเติมข้อมูล คุณสามารถช่วยเพิ่มข้อมูลส่วนนี้ได้ "
    },
    {
        "title": "What is Programer2 ?",
        "sub_title": "Programer2 คือ คนที่พัฒนาโปรแกรม..........",
        "link": "https://cdn.pixabay.com/photo/2016/08/29/08/55/work-1627703_960_720.jpg",
        "detail":"นักเขียนโปรแกรม หรือ โปรแกรมเมอร์ มีหน้าที่หลักคือการเขียนโปรแกรมคอมพิวเตอร์ ซึ่งนักเขียนโปรแกรมสามารถหมายถึงผู้ที่เชี่ยวชาญในการโปรแกรมเฉพาะด้าน หรือผู้ที่สามารถเขียนรหัสซอฟต์แวร์ได้หลากหลายข้อมูล เอดา ไบรอนได้ชื่อว่าเป็นนักเขียนโปรแกรมคนแรกของโลก เพราะเป็นคนแรกที่สามารถนำขั้นตอนวิธี มาเรียบเรียงเป็นชุดคำสั่ง ให้แก่เครื่องคำนวณได้ในปี พ.ศ. 2385 ในยุคที่ยังไม่มีเครื่องคอมพิวเตอร์ ส่วนนี้รอเพิ่มเติมข้อมูล คุณสามารถช่วยเพิ่มข้อมูลส่วนนี้ได้ "
    }
]